docs/jmeter/results/report/statistics.json
{
  "POST Create Customer" : {
    "transaction" : "POST Create Customer",
    "sampleCount" : 10,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 16.400000000000006,
    "medianResTime" : 15.5,
    "minResTime" : 14.0,
    "maxResTime" : 23.0,
    "pct1ResTime" : 22.8,
    "pct2ResTime" : 23.0,
    "pct3ResTime" : 23.0,
    "throughput" : 1.139211665527455,
    "receivedKBytesPerSec" : 0.22939984905445432,
    "sentKBytesPerSec" : 0.2850254186602871
  },
  "GET Search JPQL" : {
    "transaction" : "GET Search JPQL",
    "sampleCount" : 10,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 23.1,
    "medianResTime" : 19.0,
    "minResTime" : 14.0,
    "maxResTime" : 63.0,
    "pct1ResTime" : 59.500000000000014,
    "pct2ResTime" : 63.0,
    "pct3ResTime" : 63.0,
    "throughput" : 1.1289230074508918,
    "receivedKBytesPerSec" : 0.660045121641454,
    "sentKBytesPerSec" : 0.2667962576202303
  },
  "POST Create Main Restaurant" : {
    "transaction" : "POST Create Main Restaurant",
    "sampleCount" : 10,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 31.900000000000002,
    "medianResTime" : 30.0,
    "minResTime" : 19.0,
    "maxResTime" : 67.0,
    "pct1ResTime" : 63.90000000000001,
    "pct2ResTime" : 67.0,
    "pct3ResTime" : 67.0,
    "throughput" : 1.1096316023080337,
    "receivedKBytesPerSec" : 0.4546888870395029,
    "sentKBytesPerSec" : 0.5386697944407457
  },
  "POST Customer Bulk" : {
    "transaction" : "POST Customer Bulk",
    "sampleCount" : 10,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 22.7,
    "medianResTime" : 20.0,
    "minResTime" : 17.0,
    "maxResTime" : 39.0,
    "pct1ResTime" : 38.0,
    "pct2ResTime" : 39.0,
    "pct3ResTime" : 39.0,
    "throughput" : 1.1375270162666364,
    "receivedKBytesPerSec" : 0.4601207911500398,
    "sentKBytesPerSec" : 0.3859149271982709
  },
  "POST Transaction Rollback Expected 409" : {
    "transaction" : "POST Transaction Rollback Expected 409",
    "sampleCount" : 3,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 59.66666666666667,
    "medianResTime" : 26.0,
    "minResTime" : 18.0,
    "maxResTime" : 135.0,
    "pct1ResTime" : 135.0,
    "pct2ResTime" : 135.0,
    "pct3ResTime" : 135.0,
    "throughput" : 1.6181229773462784,
    "receivedKBytesPerSec" : 0.5230456108414239,
    "sentKBytesPerSec" : 0.6557822613268608
  },
  "POST Create Deletable Restaurant" : {
    "transaction" : "POST Create Deletable Restaurant",
    "sampleCount" : 10,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 19.0,
    "medianResTime" : 18.5,
    "minResTime" : 16.0,
    "maxResTime" : 26.0,
    "pct1ResTime" : 25.400000000000002,
    "pct2ResTime" : 26.0,
    "pct3ResTime" : 26.0,
    "throughput" : 1.1154489682097044,
    "receivedKBytesPerSec" : 0.36513524818739546,
    "sentKBytesPerSec" : 0.4467242401003904
  },
  "POST Transaction Cascade" : {
    "transaction" : "POST Transaction Cascade",
    "sampleCount" : 10,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 21.299999999999997,
    "medianResTime" : 20.0,
    "minResTime" : 16.0,
    "maxResTime" : 28.0,
    "pct1ResTime" : 27.9,
    "pct2ResTime" : 28.0,
    "pct3ResTime" : 28.0,
    "throughput" : 1.142334932602239,
    "receivedKBytesPerSec" : 0.2943966686657528,
    "sentKBytesPerSec" : 0.45972287668494405
  },
  "DELETE Restaurant" : {
    "transaction" : "DELETE Restaurant",
    "sampleCount" : 10,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 25.1,
    "medianResTime" : 21.0,
    "minResTime" : 18.0,
    "maxResTime" : 40.0,
    "pct1ResTime" : 39.6,
    "pct2ResTime" : 40.0,
    "pct3ResTime" : 40.0,
    "throughput" : 1.149029070435482,
    "receivedKBytesPerSec" : 0.08191320521659198,
    "sentKBytesPerSec" : 0.22464416005974952
  },
  "GET Restaurants By City" : {
    "transaction" : "GET Restaurants By City",
    "sampleCount" : 10,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 66.3,
    "medianResTime" : 60.0,
    "minResTime" : 49.0,
    "maxResTime" : 102.0,
    "pct1ResTime" : 100.60000000000001,
    "pct2ResTime" : 102.0,
    "pct3ResTime" : 102.0,
    "throughput" : 1.1196954428395476,
    "receivedKBytesPerSec" : 10.154784773541598,
    "sentKBytesPerSec" : 0.20447563262792523
  },
  "GET Async Task Status" : {
    "transaction" : "GET Async Task Status",
    "sampleCount" : 10,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 8.400000000000002,
    "medianResTime" : 8.5,
    "minResTime" : 7.0,
    "maxResTime" : 10.0,
    "pct1ResTime" : 10.0,
    "pct2ResTime" : 10.0,
    "pct3ResTime" : 10.0,
    "throughput" : 1.1422044545973729,
    "receivedKBytesPerSec" : 0.40445638206739004,
    "sentKBytesPerSec" : 0.20769381781838947
  },
  "POST Transaction Exception With TX Expected 409" : {
    "transaction" : "POST Transaction Exception With TX Expected 409",
    "sampleCount" : 3,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 15.666666666666666,
    "medianResTime" : 17.0,
    "minResTime" : 13.0,
    "maxResTime" : 17.0,
    "pct1ResTime" : 17.0,
    "pct2ResTime" : 17.0,
    "pct3ResTime" : 17.0,
    "throughput" : 3.5252643948296125,
    "receivedKBytesPerSec" : 1.1704979435957696,
    "sentKBytesPerSec" : 1.466565070505288
  },
  "PUT Booking Status" : {
    "transaction" : "PUT Booking Status",
    "sampleCount" : 10,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 20.3,
    "medianResTime" : 18.0,
    "minResTime" : 16.0,
    "maxResTime" : 30.0,
    "pct1ResTime" : 30.0,
    "pct2ResTime" : 30.0,
    "pct3ResTime" : 30.0,
    "throughput" : 1.1403808872163301,
    "receivedKBytesPerSec" : 0.3952355242901129,
    "sentKBytesPerSec" : 0.2550265851294332
  },
  "GET Concurrency Unsafe" : {
    "transaction" : "GET Concurrency Unsafe",
    "sampleCount" : 10,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 17.5,
    "medianResTime" : 13.0,
    "minResTime" : 12.0,
    "maxResTime" : 35.0,
    "pct1ResTime" : 34.400000000000006,
    "pct2ResTime" : 35.0,
    "pct3ResTime" : 35.0,
    "throughput" : 1.1481056257175661,
    "receivedKBytesPerSec" : 0.36573442881745116,
    "sentKBytesPerSec" : 0.26123887772675086
  },
  "GET Search Native" : {
    "transaction" : "GET Search Native",
    "sampleCount" : 10,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 18.0,
    "medianResTime" : 16.0,
    "minResTime" : 12.0,
    "maxResTime" : 30.0,
    "pct1ResTime" : 29.300000000000004,
    "pct2ResTime" : 30.0,
    "pct3ResTime" : 30.0,
    "throughput" : 1.1349449551696742,
    "receivedKBytesPerSec" : 0.6636767960503915,
    "sentKBytesPerSec" : 0.27043610259902395
  },
  "PUT Update Restaurant" : {
    "transaction" : "PUT Update Restaurant",
    "sampleCount" : 10,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 21.799999999999997,
    "medianResTime" : 19.5,
    "minResTime" : 16.0,
    "maxResTime" : 36.0,
    "pct1ResTime" : 35.1,
    "pct2ResTime" : 36.0,
    "pct3ResTime" : 36.0,
    "throughput" : 1.1362345188046814,
    "receivedKBytesPerSec" : 0.4866723241677082,
    "sentKBytesPerSec" : 0.33964979121690714
  },
  "POST Transaction Partial" : {
    "transaction" : "POST Transaction Partial",
    "sampleCount" : 10,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 26.5,
    "medianResTime" : 25.0,
    "minResTime" : 18.0,
    "maxResTime" : 36.0,
    "pct1ResTime" : 36.0,
    "pct2ResTime" : 36.0,
    "pct3ResTime" : 36.0,
    "throughput" : 1.1419435879867537,
    "receivedKBytesPerSec" : 0.3230674389060181,
    "sentKBytesPerSec" : 0.4595653834075597
  },
  "POST Transaction Exception No TX Expected 409" : {
    "transaction" : "POST Transaction Exception No TX Expected 409",
    "sampleCount" : 3,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 17.666666666666668,
    "medianResTime" : 19.0,
    "minResTime" : 14.0,
    "maxResTime" : 20.0,
    "pct1ResTime" : 20.0,
    "pct2ResTime" : 20.0,
    "pct3ResTime" : 20.0,
    "throughput" : 3.4965034965034967,
    "receivedKBytesPerSec" : 1.1643629807692308,
    "sentKBytesPerSec" : 1.447770979020979
  },
  "GET Nested NPlusOne Problem" : {
    "transaction" : "GET Nested NPlusOne Problem",
    "sampleCount" : 10,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 210.7,
    "medianResTime" : 175.0,
    "minResTime" : 153.0,
    "maxResTime" : 331.0,
    "pct1ResTime" : 327.6,
    "pct2ResTime" : 331.0,
    "pct3ResTime" : 331.0,
    "throughput" : 1.1247328759419637,
    "receivedKBytesPerSec" : 17.07364276374986,
    "sentKBytesPerSec" : 0.20539555449330785
  },
  "POST Transaction Customers Bulk With TX" : {
    "transaction" : "POST Transaction Customers Bulk With TX",
    "sampleCount" : 10,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 26.4,
    "medianResTime" : 21.5,
    "minResTime" : 16.0,
    "maxResTime" : 56.0,
    "pct1ResTime" : 54.300000000000004,
    "pct2ResTime" : 56.0,
    "pct3ResTime" : 56.0,
    "throughput" : 1.1457378551787352,
    "receivedKBytesPerSec" : 0.3345465026351971,
    "sentKBytesPerSec" : 0.4144348648029331
  },
  "GET Restaurants All" : {
    "transaction" : "GET Restaurants All",
    "sampleCount" : 10,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 90.9,
    "medianResTime" : 87.5,
    "minResTime" : 70.0,
    "maxResTime" : 156.0,
    "pct1ResTime" : 149.70000000000002,
    "pct2ResTime" : 156.0,
    "pct3ResTime" : 156.0,
    "throughput" : 1.1064394777605664,
    "receivedKBytesPerSec" : 13.80823502157557,
    "sentKBytesPerSec" : 0.19341080714759903
  },
  "GET Transaction State" : {
    "transaction" : "GET Transaction State",
    "sampleCount" : 10,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 14.0,
    "medianResTime" : 13.0,
    "minResTime" : 11.0,
    "maxResTime" : 21.0,
    "pct1ResTime" : 20.5,
    "pct2ResTime" : 21.0,
    "pct3ResTime" : 21.0,
    "throughput" : 1.1479738261967627,
    "receivedKBytesPerSec" : 0.2645720927562851,
    "sentKBytesPerSec" : 0.20403441051544025
  },
  "GET Customer By ID" : {
    "transaction" : "GET Customer By ID",
    "sampleCount" : 10,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 12.1,
    "medianResTime" : 11.0,
    "minResTime" : 10.0,
    "maxResTime" : 18.0,
    "pct1ResTime" : 17.6,
    "pct2ResTime" : 18.0,
    "pct3ResTime" : 18.0,
    "throughput" : 1.1419435879867537,
    "receivedKBytesPerSec" : 0.22994996859655134,
    "sentKBytesPerSec" : 0.19738673347036656
  },
  "GET Customers All" : {
    "transaction" : "GET Customers All",
    "sampleCount" : 10,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 11.4,
    "medianResTime" : 11.5,
    "minResTime" : 9.0,
    "maxResTime" : 13.0,
    "pct1ResTime" : 12.9,
    "pct2ResTime" : 13.0,
    "pct3ResTime" : 13.0,
    "throughput" : 1.1419435879867537,
    "receivedKBytesPerSec" : 1.9273643585131894,
    "sentKBytesPerSec" : 0.1929260163297933
  },
  "GET Concurrency Atomic" : {
    "transaction" : "GET Concurrency Atomic",
    "sampleCount" : 10,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 16.3,
    "medianResTime" : 15.0,
    "minResTime" : 14.0,
    "maxResTime" : 28.0,
    "pct1ResTime" : 26.900000000000006,
    "pct2ResTime" : 28.0,
    "pct3ResTime" : 28.0,
    "throughput" : 1.1500862564692351,
    "receivedKBytesPerSec" : 0.354909430707303,
    "sentKBytesPerSec" : 0.26168954859114435
  },
  "POST Async Customer Bulk" : {
    "transaction" : "POST Async Customer Bulk",
    "sampleCount" : 10,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 9.4,
    "medianResTime" : 9.5,
    "minResTime" : 7.0,
    "maxResTime" : 12.0,
    "pct1ResTime" : 11.9,
    "pct2ResTime" : 12.0,
    "pct3ResTime" : 12.0,
    "throughput" : 1.141682840506907,
    "receivedKBytesPerSec" : 0.2566556541842676,
    "sentKBytesPerSec" : 0.4667074580431556
  },
  "GET Booking By ID" : {
    "transaction" : "GET Booking By ID",
    "sampleCount" : 10,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 14.700000000000001,
    "medianResTime" : 14.5,
    "minResTime" : 12.0,
    "maxResTime" : 22.0,
    "pct1ResTime" : 21.300000000000004,
    "pct2ResTime" : 22.0,
    "pct3ResTime" : 22.0,
    "throughput" : 1.142465440420427,
    "receivedKBytesPerSec" : 0.3937266151605164,
    "sentKBytesPerSec" : 0.19524555866560037
  },
  "POST Transaction Customers Bulk No TX" : {
    "transaction" : "POST Transaction Customers Bulk No TX",
    "sampleCount" : 10,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 28.399999999999995,
    "medianResTime" : 23.5,
    "minResTime" : 20.0,
    "maxResTime" : 60.0,
    "pct1ResTime" : 57.60000000000001,
    "pct2ResTime" : 60.0,
    "pct3ResTime" : 60.0,
    "throughput" : 1.1429877700308608,
    "receivedKBytesPerSec" : 0.48152824608526684,
    "sentKBytesPerSec" : 0.4156725054291919
  },
  "GET Bookings All" : {
    "transaction" : "GET Bookings All",
    "sampleCount" : 10,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 34.1,
    "medianResTime" : 37.0,
    "minResTime" : 19.0,
    "maxResTime" : 44.0,
    "pct1ResTime" : 44.0,
    "pct2ResTime" : 44.0,
    "pct3ResTime" : 44.0,
    "throughput" : 1.141422212076247,
    "receivedKBytesPerSec" : 1.5938668174295174,
    "sentKBytesPerSec" : 0.19172326218468214
  },
  "GET Booking Statuses" : {
    "transaction" : "GET Booking Statuses",
    "sampleCount" : 10,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 8.800000000000002,
    "medianResTime" : 8.0,
    "minResTime" : 7.0,
    "maxResTime" : 12.0,
    "pct1ResTime" : 12.0,
    "pct2ResTime" : 12.0,
    "pct3ResTime" : 12.0,
    "throughput" : 1.1427265455376527,
    "receivedKBytesPerSec" : 0.19863801279853732,
    "sentKBytesPerSec" : 0.20198584447491716
  },
  "POST Create Booking" : {
    "transaction" : "POST Create Booking",
    "sampleCount" : 10,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 21.9,
    "medianResTime" : 18.5,
    "minResTime" : 14.0,
    "maxResTime" : 46.0,
    "pct1ResTime" : 44.00000000000001,
    "pct2ResTime" : 46.0,
    "pct3ResTime" : 46.0,
    "throughput" : 1.1411617026132603,
    "receivedKBytesPerSec" : 0.39327730942599565,
    "sentKBytesPerSec" : 0.3317615613944996
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 309,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 34.98058252427184,
    "medianResTime" : 19.0,
    "minResTime" : 7.0,
    "maxResTime" : 331.0,
    "pct1ResTime" : 84.0,
    "pct2ResTime" : 123.0,
    "pct3ResTime" : 261.69999999999857,
    "throughput" : 7.7610890641482895,
    "receivedKBytesPerSec" : 19.412362210842918,
    "sentKBytesPerSec" : 2.011330224606922
  },
  "GET Restaurant By ID" : {
    "transaction" : "GET Restaurant By ID",
    "sampleCount" : 10,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 15.4,
    "medianResTime" : 14.5,
    "minResTime" : 11.0,
    "maxResTime" : 28.0,
    "pct1ResTime" : 26.800000000000004,
    "pct2ResTime" : 28.0,
    "pct3ResTime" : 28.0,
    "throughput" : 1.1238480557428636,
    "receivedKBytesPerSec" : 0.46051430096650936,
    "sentKBytesPerSec" : 0.19535640031467746
  },
  "GET NPlusOne Optimized" : {
    "transaction" : "GET NPlusOne Optimized",
    "sampleCount" : 10,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 99.3,
    "medianResTime" : 86.5,
    "minResTime" : 73.0,
    "maxResTime" : 183.0,
    "pct1ResTime" : 178.3,
    "pct2ResTime" : 183.0,
    "pct3ResTime" : 183.0,
    "throughput" : 1.1336583153837432,
    "receivedKBytesPerSec" : 16.936567388901487,
    "sentKBytesPerSec" : 0.2014900521482825
  },
  "GET NPlusOne Problem" : {
    "transaction" : "GET NPlusOne Problem",
    "sampleCount" : 10,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 100.9,
    "medianResTime" : 87.5,
    "minResTime" : 75.0,
    "maxResTime" : 191.0,
    "pct1ResTime" : 183.00000000000003,
    "pct2ResTime" : 191.0,
    "pct3ResTime" : 191.0,
    "throughput" : 1.1337868480725624,
    "receivedKBytesPerSec" : 16.684160643424036,
    "sentKBytesPerSec" : 0.19929846938775508
  }
}